let hall_of_famers = [
	{
		competition_type: "Математик",
		names: [
			"Мөнхбатын Өнөболд",
			"Отгонбаярын Мишээл",
			"Амарын Нямдаваа",
			"Энхбаярын Төрбат",
			"Өлзийбатын Баттулга",
		],
	},
	{
		competition_type: "Мэдээлэл Зүй",
		names: [
			"Амарын Нямдаваа",
			"Энхбаатарын Жангар",
			"Батсүхийн Бат-Эрдэнэ",
			"Олонбаатарын Тэнүүн",
			"Бүрэнтогтохын Батбаатар",
			"Чандманий Доржнамжил",
		],
	},
	{
		competition_type: "Физик",
		names: [
			"Отгончулууны Анирчулуу",
			"Сарангэрэлын Сумъяажав",
			"Лхагвадоржийн Дөлгөөн",
			"Хасгэрэлын Цэрэнчимэг",
			"Бат-Эрдэнийн Бат-Амгалан",
			"Дашдоржийн Оргилболд",
			"Мягмарын Отгонбаатар",
		],
	},
	{
		competition_type: "Биологи",
		names: [
			"Энхтүвшингийн Тэргэл",
			"Батжаргалын Хулан",
			"Чинбатын Жаргалан",
			"Эрдэнэбаатарын Бодьхүү",
			"Болорын Пүрэвбадрал",
			"Батбаярын Батбаяр",
			"Бямбаагийн Билгүүн",
			"Амарсанаагийн Ашид",
			"Эрдэнэболдын Баттулга",
		],
	},
	{
		competition_type: "Хими",
		names: [
			"Орхоны Тэмүжин",
			"Алтанхуягийн Ирмүүн",
			"Баярмагнайн Гэрэл",
			"Долгормаагийн Бумчин",
			"Амарсанаагийн Ашид",
			"Билэгсайханы Арвин",
			"Сүндэръяагийн Сувданчимэг",
			"Сандагдоржийн Хас-Ананд",
			"Хасбаатар Батхишиг",
			"Наранхүүгийн Тэмүүжин",
			"Батжаргалын Бат-Оргил",
			"Батнасангийн Ганбадрах",
			"Мягмарын Энхбат",
			"Даваасүрэнгийн Амарсанаа",
			"Гансүхийн Ганхөлөг",
			"Дагвадоржийн Уянга",
			"Түвшиндоржийн Урандэлгэр",
		],
	},
];

export default function HallofFame() {
	return (
		<main>
			<h2>Мэргэд</h2>
			{hall_of_famers.map((group) => (
				<div>
					<h3>{group.competition_type}</h3>
					<ul>
						{group.names.map((halloffamer) => (
							<li>{halloffamer}</li>
						))}
					</ul>
				</div>
			))}
		</main>
	);
}
